// 色彩検定クイズ用の色データ
export const colors2 = [
    {
        "name": "鴇色",
        "hex": "#BF943F",
        "pccs": "lt24+",
        "munsell": "7RP 7.5/8",
        "ruby": "ときいろ",
        "desc": "トキの翼の内側や風切羽、尾羽などは明るいピンクをしているが、その色からとられた近世の和装で流行した色名。<br> トキの体色は一見すると白だが、飛ぶときにはピンクが見える。<br> 昔は日本各地に生息していたので、人々はその色も知っていたのだろう。"
    },
    {
        "name": "韓紅花",
        "hex": "#8C2300",
        "pccs": "b2",
        "munsell": "1.5R 5.5/13",
        "ruby": "からくれない",
        "desc": "日本で呉(くれ)と呼んだ中国の地域から渡来した染料という意味で、紅花の赤を「呉藍(くれない)」と呼んでいたことに由来する。<br> 平安時代から使われるようになった伝統的な色名。<br> 王朝貴族に愛された紅の色だった。"
    },


];

export const colors3 = [
    {
        "name": "桜色",
        "hex": "#DDE5B5",
        "pccs": "p24+",
        "munsell": "10RP 9/2.5",
        "ruby": "さくらいろ",
        "desc": "平安時代から愛好され「古今和歌集」にも登場し詩歌の中に定着した。紅染めの中で最も淡い色調。"
    },
    {
        "name": "珊瑚色",
        "hex": "#B2530E",
        "pccs": "lt2+",
        "munsell": "2.5R 7/11",
        "ruby": "さんごいろ",
        "desc": "装飾品などで特に珍重されたピンク系の和名色。"
    },
    {
        "name": "紅梅色",
        "hex": "#A5693E",
        "pccs": "p23",
        "munsell": "2.5R 6.5/7.5",
        "ruby": "こうばいいろ",
        "desc": "平安時代には冬から春にかけての色として愛好された。春の盛りにはややくどいと感じられることも。清少納言は「すさまじき」色とし、見飽きのする色とも述べている。"
    },
    {
        "name": "茜色",
        "hex": "#593D07",
        "pccs": "d2",
        "munsell": "4R 3.5/11",
        "ruby": "あかねいろ",
        "desc": "日本の山野にも自生するつる草の根を原料とする染料で染めた色名。照りはえる、という意味の枕詞として「万葉集」にも用いられた。日本で最古の植物染料の一つ。"
    },
    {
        "name": "朱色",
        "hex": "#8C8C00",
        "pccs": "v2",
        "munsell": "6R 5.5/14",
        "ruby": "しゅいろ",
        "desc": "硫化水銀を原料とする銀朱の色。東洋で印鑑の朱肉の色として知られる。絶大な権威の象徴としても使われ、江戸時代に将軍だけが発行する公文書などで登場した。"
    },
];

export const colors1 = [...colors2, ...colors3];
